{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.3.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "functional_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                10
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dense",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1024,
              "activation": "relu",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              [
                [
                  "dense_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 5120,
              "activation": "relu",
              "use_bias": true,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_3",
            "inbound_nodes": [
              [
                [
                  "dense_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "a_out",
              "trainable": true,
              "dtype": "float32",
              "units": 17,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "a_out",
            "inbound_nodes": [
              [
                [
                  "dense_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "b_out",
              "trainable": true,
              "dtype": "float32",
              "units": 27,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "b_out",
            "inbound_nodes": [
              [
                [
                  "dense_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "c_out",
              "trainable": true,
              "dtype": "float32",
              "units": 71,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "c_out",
            "inbound_nodes": [
              [
                [
                  "dense_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "z_out",
              "trainable": true,
              "dtype": "float32",
              "units": 29,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "z_out",
            "inbound_nodes": [
              [
                [
                  "dense_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "a_out",
            0,
            0
          ],
          [
            "b_out",
            0,
            0
          ],
          [
            "c_out",
            0,
            0
          ],
          [
            "z_out",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": {
        "a_out": "categorical_crossentropy",
        "b_out": "categorical_crossentropy",
        "c_out": "categorical_crossentropy",
        "z_out": "categorical_crossentropy"
      },
      "metrics": [
        "categorical_accuracy"
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "name": "RMSprop",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "rho": 0.8999999761581421,
          "momentum": 0.0,
          "epsilon": 1e-07,
          "centered": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of6.bin",
        "group1-shard2of6.bin",
        "group1-shard3of6.bin",
        "group1-shard4of6.bin",
        "group1-shard5of6.bin",
        "group1-shard6of6.bin"
      ],
      "weights": [
        {
          "name": "a_out/kernel",
          "shape": [
            5120,
            17
          ],
          "dtype": "float32"
        },
        {
          "name": "a_out/bias",
          "shape": [
            17
          ],
          "dtype": "float32"
        },
        {
          "name": "b_out/kernel",
          "shape": [
            5120,
            27
          ],
          "dtype": "float32"
        },
        {
          "name": "b_out/bias",
          "shape": [
            27
          ],
          "dtype": "float32"
        },
        {
          "name": "c_out/kernel",
          "shape": [
            5120,
            71
          ],
          "dtype": "float32"
        },
        {
          "name": "c_out/bias",
          "shape": [
            71
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            10,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            512,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            128,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            1024,
            5120
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            5120
          ],
          "dtype": "float32"
        },
        {
          "name": "z_out/kernel",
          "shape": [
            5120,
            29
          ],
          "dtype": "float32"
        },
        {
          "name": "z_out/bias",
          "shape": [
            29
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}